## Subset Observations (Rows)
#### ex.3 를 가져와서.

##### 1 Logic in Python (and pandas)

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({"a" : [4, 5, 6],
                   "b" : [7, 8, 9],
                   "c" : [10, 11, 12]},
                 index = pd.MultiIndex.from_tuples(
                         [('d' , 1), ('d', 2), ('e', 2)],
                 names = ['n', 'v']))
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [3]:
df[df.a > 7]       # a column 에 7보다 큰 값이 있다면 df 를 출력  (값이 안나온다.)
df[df.a < 7]       # a column 에 7보다 작은 값이 있다면 df 를 출력
df[df.b > 7]       # b column 에 7보다 큰 값이 있다면 그 행 출력
df.b > 7           # df[] 없이 쓰게되면 bool값으로 표기 위와 같이 df[]씌웠을때 True인 값이 출력됨을 알 수 있다.
# df[df.c > 7] 와 df[df['c'] > 7] 는 결괏값이 같다.

n  v
d  1    False
   2     True
e  2     True
Name: b, dtype: bool

In [4]:
df1 = pd.DataFrame({"a" : [4, 5, 6, 6],
                   "b" : [7, 8, 9, 9],
                   "c" : [10, 11, 12, 12]},
                 index = pd.MultiIndex.from_tuples(
                         [('d' , 1), ('d', 2), ('e', 2), ('e', 3)],
                 names = ['n', 'v']))
df1

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

##### 2. duplicates 중복된 행 제거하기

In [5]:
# 2,3행의 결과는 같으나 Pandas에서 권장하는 코드는 3행임.
# df1.drop_duplicates(inplace=True)      # inplace=True 속성이 없으면 중복값이 사라진 결과를 보여주기만함.(반영X)
df1 = df1.drop_duplicates()
df1

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [6]:
df.drop_duplicates?
# 어떤 파라메터가 사용 가능한지 도움말이 나온다

In [7]:
df = df.drop_duplicates(keep='last')    # 중복된 row 중 마지막내용을 사용한다.

In [8]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

##### 3 isin

In [9]:
# 2,3 행의 결과는 같다.
df.a.isin([5,6])
df['a'].isin([5,6])

n  v
d  1    False
   2     True
e  2     True
Name: a, dtype: bool

##### 4 Null 값과, 그 갯수확인 (feat. null 값을 만들기 위해 Numpy import)

In [10]:
import numpy as np

In [11]:
df1 = pd.DataFrame({"a" : [4, 5, 6, 6, np.nan],
                   "b" : [7, 8, np.nan, 9, 9],
                   "c" : [10, 11, 12, np.nan, 12]},
                 index = pd.MultiIndex.from_tuples(
                         [('d' , 1), ('d', 2), ('e', 2), ('e', 3),('e', 4)],
                 names = ['n', 'v']))
df1

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [12]:
pd.isnull(df1)
# df1.isnull()    같은 결과 값. 이런 2가지 방법이 있음

         a      b      c
n v
d 1  False  False  False
  2  False  False  False
e 2  False   True  False
  3  False  False   True
  4   True  False  False

In [13]:
df1['a'].isnull()
# df1.a.isnull()      1 번과 같은 결과
df1['a'].isnull().sum()

1

In [14]:
pd.notnull(df1)
df1.notnull()     # 역시 위, 아래 같은 결과

         a      b      c
n v
d 1   True   True   True
  2   True   True   True
e 2   True  False   True
  3   True   True  False
  4  False   True   True

In [15]:
df1.a.notnull()
df1.a.notnull().sum()

4

## Logical
* and, or, not, xor, any, all 파이썬 연산자는 둘다.
* &, |, ~, ^, df.any() ,df.all() 판다스는 이 행의 연산자만 사용가능.

In [16]:
df.any()
df.all()

a    True
b    True
c    True
dtype: bool

In [17]:
~df1.a.notnull()   # 아닌것을 거져온다.

n  v
d  1    False
   2    False
e  2    False
   3    False
   4     True
Name: a, dtype: bool

In [22]:
# 뭐가 문젠지 에러가난다. ㅜㅜ
# df1[df1.b == 7] & df1[df1.a == 5]
df1[(df1.b == 7) & (df1.a == 5)]

Empty DataFrame
Columns: [a, b, c]
Index: []